感知器.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-03 Wed 17:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>感知器（Perceptron)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="dctrl" />
<link rel="stylesheet" type="text/css" href="/css/worg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">感知器（Perceptron)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd9a6549">1. 相关概念</a>
<ul>
<li><a href="#orge7769cd">1.1. 超平面</a>
<ul>
<li><a href="#org49b8425">1.1.1. 点到超平面的距离推导</a></li>
<li><a href="#orged60d43">1.1.2. 线性方程组的概念</a></li>
<li><a href="#org8cad74a">1.1.3. 感知器的对偶形式</a>
<ul>
<li><a href="#orgac1d70a">1.1.3.1. 对偶形式的意义</a></li>
</ul>
</li>
<li><a href="#org33d52b2">1.1.4. 总结</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd9a6549" class="outline-2">
<h2 id="orgd9a6549"><span class="section-number-2">1</span> 相关概念</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge7769cd" class="outline-3">
<h3 id="orge7769cd"><span class="section-number-3">1.1</span> <a href="https://blog.csdn.net/dengheCSDN/article/details/77313758">超平面</a></h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org49b8425" class="outline-4">
<h4 id="org49b8425"><span class="section-number-4">1.1.1</span> <a href="https://blog.csdn.net/qq_22709065/article/details/71170559">点到超平面的距离推导</a></h4>
</div>
<div id="outline-container-orged60d43" class="outline-4">
<h4 id="orged60d43"><span class="section-number-4">1.1.2</span> 线性方程组的概念</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
重点是在于N维空间下，自由度比空间维度小1，由此自然便可得到N维空间对
N-1维空间的一个子集合。
</p>
</div>
</div>
<div id="outline-container-org8cad74a" class="outline-4">
<h4 id="org8cad74a"><span class="section-number-4">1.1.3</span> 感知器的对偶形式</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
关键：将w和b表示为实例x<sub>i</sub>和y<sub>i</sub>的<a href="https://baike.baidu.com/item/%E7%BA%BF%E6%80%A7%E7%BB%84%E5%90%88">线性组合</a>的形式，通过求解其系数而求的w和b。
</p>
</div>
<div id="outline-container-orgac1d70a" class="outline-5">
<h5 id="orgac1d70a"><span class="section-number-5">1.1.3.1</span> 对偶形式的意义</h5>
<div class="outline-text-5" id="text-1-1-3-1">
<p>
<a href="https://www.zhihu.com/question/26526858">为何存在</a>
对偶形式的目的是降低运算量，当特征空间维度很高时可以起作用。
因为，当维度很高，原始形式为判断某点是否为误判点，则需要花费较长时间进行关于w和x<sub>i</sub>的内积运算
两公式对比如下：
</p>
\begin{equation}
y_{i}(wx_{i} + b) \leq 0\\
y_{i}(\sum_{i=1}^{N}a_{j}y_{j}x_{j}x_{i} + b) \leq 0\\

\end{equation}
<p>
由对偶形式的公式可知，所有输入实例都以内积形式出现，则可以预先计算两两之间的内积，得到所谓
Gram矩阵 \(G = [x_{i}x_{j}]_{N \times N}\)
</p>
</div>
</div>
</div>
<div id="outline-container-org33d52b2" class="outline-4">
<h4 id="org33d52b2"><span class="section-number-4">1.1.4</span> 总结</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
w为超平面法向量，超平面到平面上任意一点的距离为 \(d=\frac{|w \cdot x_{0}+b|}{||w||}\)
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: dctrl</p>
<p class="date">Created: 2018-10-03 Wed 17:16</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
